app/views/recipes/_recipe_form.html.haml

SELECT "beer_styles".* FROM "beer_styles"
---

    .field-row
      .field-group
        .field-label= f.label :beer_style
        .field= f.collection_select(:beer_style, BeerStyle.all, :id, :name,
          {:include_blank => true},
          {:class => 'chzn-select', :'data-placeholder' => "Choose a Beer Style..."})