app/controllers/beer_styles_controller.rb

SELECT "beer_styles".* FROM "beer_styles" WHERE ("beer_styles"."id" = 980190962) LIMIT 1
---
    def find_beer_style
        @beer_style = BeerStyle.find(params[:id])

SELECT "beer_styles".* FROM "beer_styles"
---
  def index
    @beer_styles = BeerStyle.order :name

INSERT INTO `beer_styles` (`name`, `created_at`, `updated_at`, `description`) VALUES('American IPA', '2010-08-04 20:18:02', '2010-08-04 20:18:02', 'The American IPA is a different soul from the reincarnated IPA style. More flavorful than the withering English IPA, color can range from very pale golden to reddish amber. Hops are typically American with a big herbal and / or citric character, bitterness is high as well. Moderate to medium bodied with a balancing malt backbone.')
---
  def create
    authorize! :create, BeerStyle
    @beer_style = BeerStyle.new(params[:beer_style])

    if @beer_style.save

UPDATE `beer_styles` SET `updated_at` = '2010-08-04 20:26:49', `description` = 'The American IPA is a different soul from the reincarnated IPA style. More flavorful than the withering English IPA, color can range from very pale golden to reddish amber. Hops are typically American with a big herbal and / or citric character, bitterness is high as well. Moderate to medium bodied with a balancing malt backbone.\r\n\r\nAverage alcohol by volume (abv) range: 5.5-7.5%' WHERE `id` = 1
---
  def update
    authorize! :update, @beer_style

    if @beer_style.update_attributes(params[:beer_style])

DELETE FROM "beer_styles" WHERE ("beer_styles"."id" = 980190962)
---
  def destroy
    authorize! :destroy, @beer_style

    @beer_style.destroy