app/controllers/ingredients_controller.rb

  def show
    @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE ("ingredients"."id" = 980190962) LIMIT 1

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE ("ingredients"."id" = 980190962) LIMIT 1

  def update
    @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE ("ingredients"."id" = 980190962) LIMIT 1

  def destroy
    @ingredient = Ingredient.find(params[:id])
    @ingredient.destroy
---
SELECT "ingredients".* FROM "ingredients" WHERE ("ingredients"."id" = 980190962) LIMIT 1
DELETE FROM "ingredients" WHERE ("ingredients"."id" = 980190962)