app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE ("recipes"."id" = 980190962) LIMIT 1
---
    def find_recipe
      @recipe = Recipe.find(params[:id])

INSERT INTO `recipes` (`name`, `mash_type`, `description`, `batch_size`, `original_gravity`, `final_gravity`, `bitterness`, `color`, `procedure`, `created_at`, `updated_at`) VALUES('Toad Spit Stout', 'extract', 'Taken from Charlie Papazian', '5 gallons', '1.60', '1.12', '43 IBUs', '30 SBU', 'do it.', '2010-08-04 22:21:53', '2010-08-04 22:21:53')
---
  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save

DELETE FROM "recipes" WHERE ("recipes"."id" = 980190962)
---
  def destroy
    @recipe.destroy